app/controllers/games_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    game = Game.find(params[:id]) # look up movie by unique ID
   # game.find_words
    params[:chain_to_keep] = params[:chain] == nil ? "" : params[:chain][:chain_to_keep].downcase!
    @words = game.get_words_sorted(params[:chain_to_keep])
    @game = game
    @games = Game.order("updated_at").reverse
    @played = game.get_words_played_sorted
    game.touch
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "6"]]
SELECT "games".* FROM "games" ORDER BY updated_at
UPDATE "games" SET "updated_at" = '2013-05-07 18:33:24.363296' WHERE "games"."id" = 6

  def index
    @games = Game.order("updated_at").reverse
---
SELECT "games".* FROM "games" ORDER BY updated_at

  def create
    @game = Game.create!(:title => params[:game][:title].downcase!, :title_ordered => params[:game][:title].chars.sort.join.downcase!)
---
INSERT INTO "games" ("created_at", "title", "title_ordered", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 07 May 2013 21:50:10 UTC +00:00], ["title", "testLetters"], ["title_ordered", "Leeersstttt"], ["updated_at", Tue, 07 May 2013 21:50:10 UTC +00:00]]

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 6]]

  def move_word
    @game = Game.find(params[:id])
    @word = Word.where(:text => params[:word])
    link = WordGameLink.where(:word_id => @word, :game_id => @game).first
    link.play
    link.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "7"]]
SELECT "words".* FROM "words" WHERE "words"."text" = 'setters'
SELECT "word_game_links".* FROM "word_game_links" WHERE "word_game_links"."word_id" IN (SELECT "words"."id" FROM "words" WHERE "words"."text" = 'setters') AND "word_game_links"."game_id" = 7 LIMIT 1
UPDATE "word_game_links" SET "played" = 't' WHERE "word_game_links"."id" = 9222