app/controllers/words_controller.rb

SELECT "words".* FROM "words" ORDER BY text LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "words"
---
  def index
    if params[:offset] == nil then params[:offset] = 0 end
    @words = Word.order("text").offset(params[:offset]).limit(50)
    params[:showPrev] = params[:showNext] = false
    if params[:offset] > 0 then params[:showPrev] = true end
    if params[:offset] + 50 < Word.count then params[:showNext] = true end